
class ConstFile {
  static const List<String> qualificationsItems = <String>["一等無人航空機操縦士","なし"];
  static const List<String> prefectureItems = <String>[
    "北海道",
    "青森県",
    "岩手県",
    "宮城県",
    "秋田県",
    "山形県",
    "福島県",
    "茨城県",
    "栃木県",
    "群馬県",
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県",
    "新潟県",
    "富山県",
    "石川県",
    "福井県",
    "山梨県",
    "長野県",
    "岐阜県",
    "静岡県",
    "愛知県",
    "三重県",
    "滋賀県",
    "京都府",
    "大阪府",
    "兵庫県",
    "奈良県",
    "和歌山県",
    "鳥取県",
    "島根県",
    "岡山県",
    "広島県",
    "山口県",
    "徳島県",
    "香川県",
    "愛媛県",
    "高知県",
    "福岡県",
    "佐賀県",
    "長崎県",
    "熊本県",
    "大分県",
    "宮崎県",
    "鹿児島県",
    "沖縄県"
  ];
  static const List<String> bodyTypes = <String>[
    "スレンダー",
    "細め",
    "普通",
    "グラマー",
    "ぽっちゃり",
    "太め"
  ];
  static const List<String> attitudes = <String>[
    "まだ未定",
    "1年以内には",
    "2〜3年以内にしたい",
    "良い人がいればすぐにでも"
  ];
  static const String term_summary = "＿＿＿＿＿＿＿＿（以下，「当社」といいます。）は，本ウェブサイト上で提供するサービス（以下,「本サービス」といいます。）における，ユーザーの個人情報の取扱いについて，以下のとおりプライバシーポリシー（以下，「本ポリシー」といいます。）を定めます。";
  static const String term_section1 = "第1条（個人情報）\n「個人情報」とは，個人情報保護法にいう「個人情報」を指すものとし，生存する個人に関する情報であって，当該情報に含まれる氏名，生年月日，住所，電話番号，連絡先その他の記述等により特定の個人を識別できる情報及び容貌，指紋，声紋にかかるデータ，及び健康保険証の保険者番号などの当該情報単体から特定の個人を識別できる情報（個人識別情報）を指します。";
  static const String trackRecord = "農作物の監視や管理にドローンを活用し、作況や病害虫の発生などをリアルタイムで把握することで、効果的な農業生産管理を実現した。これにより、農産物の収穫量や品質の向上に貢献した。建設現場での進捗管理や安全性の確保のために、ドローンを使用して航空写真を撮影し、建設プロジェクトの進行状況をモニタリングした。また、建設現場の安全監視や環境保護活動にも貢献した。観光地やリゾート地での観光客の案内や安全管理、施設の点検などにドローンを利用した。航空撮影や観光名所のパノラマ映像制作など、観光体験の向上に寄与した。";
  static const String biography = "20XX年：航空工学の学位を取得。\n20XX年 - 20XX年：民間航空会社にて航空機整備士として勤務。航空機の保守点検や修理業務に従事。\n20XX年：一等無人航空機操縦士の資格取得。\n20XX年 - 現在：ドローン技術を活かし、災害対応、農業支援、建設業での利用など、さまざまな分野で活動。ドローンを使った空撮や測量、安全管理などの業務に従事。\n20XX年 - 現在：ドローンの教育・指導にも従事。無人航空機の操縦技術や安全性に関する講習会やセミナーの講師を務める。";
  static const String jobtext= "私たちは農地の効果的な管理を目指し、農薬散布の作業を計画しております。このため、貴重なスキルと経験を持つ皆様にお声がけすることとなりました。\nご担当いただく内容は、農地全体への農薬の散布です。以下に詳細を記載いたします。\n作業日時: [指定の日時を記入]\n農地の場所: [農地の場所を記入]\n散布する農薬: [使用する農薬の種類と量を記入]\n支払い条件: [報酬や支払い条件を記入]\nまた、安全性と効率性を確保するため、次の要件を満たすことをお願いいたします。\n適切なライセンスを保有していること\nドローンの操作に関する経験を有していること\n安全な作業を確保するための適切な装備を所有していること\nご興味がありましたら、お気軽にご連絡ください。詳細をご相談させていただきます。";
}